aaron-bond.better-comments
adam-bender.commit-message-editor
anthropic.claude-code
bradlc.vscode-tailwindcss
christian-kohler.path-intellisense
ckolkman.vscode-postgres
cweijan.dbclient-jdbc
cweijan.vscode-database-client2
dbaeumer.vscode-eslint
donjayamanne.githistory
eamodio.gitlens
ecmel.vscode-html-css
esbenp.prettier-vscode
formulahendry.code-runner
frenco.vscode-vercel
github.codespaces
github.remotehub
github.vscode-pull-request-github
howardzuo.vscode-git-tags
lanly-dev.letmeplaythemusic
mhutchie.git-graph
ms-dotnettools.vscode-dotnet-runtime
ms-mssql.data-workspace-vscode
ms-mssql.mssql
ms-mssql.sql-bindings-vscode
ms-mssql.sql-database-projects-vscode
ms-playwright.playwright
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.azure-repos
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.remote-explorer
ms-vscode.remote-repositories
mtxr.sqltools
njpwerner.autodocstring
numso.prettier-standard-vscode
pkief.material-icon-theme
rangav.vscode-thunder-client
redhat.java
rishi-reddy.vscode-mcp-server
ritwickdey.liveserver
rvest.vs-code-prettier-eslint
sakamoto66.vscode-playwright-test-runner
tamasfe.even-better-toml
usernamehw.errorlens
vinirossa.vscode-gitandgithub-pack
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vueplay.vueplay
xabikos.javascriptsnippets
yoavbls.pretty-ts-errors
ziyasal.vscode-open-in-github
